; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain test_domain)
    (:requirements :typing :equality)
    (:types
        location - object
        locatable - object
        driver - locatable
        truck - locatable
        obj - locatable
    )

    (:constants
        
    )

    (:predicates
        (at ?x1 - locatable ?x2 - location)
        (in ?x1 - obj ?x2 - truck)
        (driving ?x1 - driver ?x2 - truck)
        (link ?x1 - location ?x2 - location)
        (path ?x1 - location ?x2 - location)
        (empty ?x1 - truck)
    )

    (:functions
        
    )

    

    
    (:action LOAD-TRUCK
     :parameters (?obj - obj ?truck - truck ?loc - location)
     :precondition (at ?obj ?loc)
     :effect (and
        (in ?obj ?truck)
        (not (at ?obj ?loc)))
    )


    (:action UNLOAD-TRUCK
     :parameters (?obj - obj ?truck - truck ?loc - location)
     :precondition (and (at ?truck ?loc) (in ?obj ?truck))
     :effect (and
        (at ?obj ?loc)
        (not (in ?obj ?truck)))
    )


    (:action BOARD-TRUCK
     :parameters (?driver - driver ?truck - truck ?loc - location)
     :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
     :effect (and
        (driving ?driver ?truck)
        (not (at ?driver ?loc))
        (not (empty ?truck)))
    )


    (:action DISEMBARK-TRUCK
     :parameters (?driver - driver ?truck - truck ?loc - location)
     :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
     :effect (and
        (at ?driver ?loc)
        (empty ?truck)
        (not (driving ?driver ?truck)))
    )


    (:action DRIVE-TRUCK
     :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
     :precondition (and (driving ?driver ?truck) (link ?loc-from ?loc-to))
     :effect (and
        (at ?truck ?loc-to)
        (not (at ?truck ?loc-from)))
    )


    (:action WALK
     :parameters (?driver - driver ?loc-from - location ?loc-to - location)
     :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
     :effect (and
        (at ?driver ?loc-to)
        (not (at ?driver ?loc-from)))
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem instance1)
    (:domain test_domain)

    (:objects
        driver1 driver2 driver3 - driver
        p0-1 p0-2 p1-2 s0 s1 s2 - location
        package1 package2 package3 package4 package5 - obj
        truck1 truck2 - truck
    )

    (:init
        (at package1 s0)
        (at truck2 s1)
        (at package4 s2)
        (at package3 s2)
        (at driver1 s1)
        (at package5 s1)
        (at truck1 s1)
        (at package2 s0)
        (at driver2 s0)
        (at driver3 s0)
        (empty truck2)
        (empty truck1)
        (path p1-2 s2)
        (path p0-2 s2)
        (path p0-1 s0)
        (path p1-2 s1)
        (path p0-1 s1)
        (path s0 p0-2)
        (path p0-2 s0)
        (path s1 p1-2)
        (path s2 p1-2)
        (path s0 p0-1)
        (path s2 p0-2)
        (link s1 s2)
        (link s1 s0)
        (link s0 s2)
        (link s2 s0)
        (link s0 s1)
        (link s2 s1)
    )

    (:goal
        (and (at package4 s0) (at driver2 s2) (at truck2 s2) (at package2 s1) (at truck1 s2) (at package3 s1) (at package1 s1) (at package5 s1))
    )

    
    
    
)

; plan
1. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 1 of 8
2. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 1 of 8
3. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 2 of 8
4. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 2 of 8
5. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 3 of 8
6. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   goals met: 3 of 8
7. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 3 of 8
8. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 8
9. (drive-truck truck2 s0 s2 driver1)
   added: (at truck2 s2)
   goals met: 4 of 8
10. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   goals met: 5 of 8
11. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 8
12. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 5 of 8
13. (drive-truck truck1 s0 s2 driver2)
   added: (at truck1 s2)
   goals met: 6 of 8
14. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 7 of 8
15. (load-truck package4 truck2 s2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   goals met: 7 of 8
16. (unload-truck package4 truck2 s0)
   deleted: (in package4 truck2)
   added: (at package4 s0)
   goals met: 8 of 8
